soap/test/confirmReports.1.xml


<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://xml.m4u.com.au/2009">
 <env:Body>
  <ns:confirmReports>
   <ns:authentication>
    <ns:userId>my-user-id</ns:userId>
    <ns:password>my-password</ns:password>
   </ns:authentication>
   <ns:requestBody>
    <ns:reports>
     <ns:report receiptId="123"/>
     <ns:report receiptId="456"/>
     <ns:report receiptId="789"/>
    </ns:reports>
   </ns:requestBody>
  </ns:confirmReports>
 </env:Body>
</env:Envelope>

