soap/test/deleteScheduledMessages.1.xml


<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://xml.m4u.com.au/2009">
 <env:Body>
  <ns:deleteScheduledMessages>
   <ns:authentication>
    <ns:userId>my-user-id</ns:userId>
    <ns:password>my-password</ns:password>
   </ns:authentication>
   <ns:requestBody>
    <ns:messages>
     <ns:message messageId="123"/>
     <ns:message messageId="456"/>
     <ns:message messageId="789"/>
    </ns:messages>
   </ns:requestBody>
  </ns:deleteScheduledMessages>
 </env:Body>
</env:Envelope>

